Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory.CreateInputDefinition Method (ViewBase, DrawingObject)
 Creates a single-object input definition.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static DrawingPluginBase.InputDefinition CreateInputDefinition(
	ViewBase view,
	DrawingObject drawingObject
)
Public Shared Function CreateInputDefinition (
	view As ViewBase,
	drawingObject As DrawingObject
) As DrawingPluginBase.InputDefinition
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used in the input.
drawingObject
Type: Tekla.Structures.Drawing.DrawingObject
The object to be used in the input.
Return Value
Type: DrawingPluginBase.InputDefinition
The input definition.
See Also
Reference
InputDefinitionFactory Class
CreateInputDefinition Overload
Tekla.Structures.Drawing.Tools Namespace